---
kind: property
id: P:Autodesk.Revit.DB.TextElement.Symbol
source: html/6e9bdd6f-14ef-94c6-cd94-ad735d18885f.htm
---
# Autodesk.Revit.DB.TextElement.Symbol Property

Get the type of the TextElement object.

## Syntax (C#)
```csharp
public TextElementType Symbol { get; }
```

## Remarks
The user can call this property to get the related type.